In [29]:
import pandas as pd

In [30]:
header_list = ["SNo", "Name", "Sub" ,"Math","Hindi","Eng"]

In [31]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv',  names=header_list)

In [32]:
df.head(5)

                             SNo  Name  Sub  Math  Hindi  Eng
0  1|Akshay|Mathematics|50|40|80   NaN  NaN   NaN    NaN  NaN
1      2|Mahima|English|40|33|83   NaN  NaN   NaN    NaN  NaN
2   3|Vikas|Mathematics|50|42|84   NaN  NaN   NaN    NaN  NaN
3     4|Abhinav|English|40|31|78   NaN  NaN   NaN    NaN  NaN
4      5|Mahima|Science|50|40|80   NaN  NaN   NaN    NaN  NaN

In [11]:
df1=df.columns[])

TypeError: 'Index' object is not callable

In [7]:
df

     1|Akshay|Mathematics|50|40|80
0        2|Mahima|English|40|33|83
1     3|Vikas|Mathematics|50|42|84
2       4|Abhinav|English|40|31|78
3        5|Mahima|Science|50|40|80
4        6|Akshay|Science|50|49|98
5   7|Abhinav|Mathematics|50|47|94
6         8|Vikas|Science|50|40|80
7       9|Abhinav|Science|50|47|94
8        10|Vikas|English|40|39|98
9       11|Akshay|English|40|35|88
10  12|Mahima|Mathematics|50|43|86